Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresVariables.Get Method
 Gets a key.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string Get(
	string key
)
Public Shared Function Get (
	key As String
) As String
Parameters
key
Type: System.String
The key to get.
Return Value
Type: String
The key.
See Also
Reference
TeklaStructuresVariables Class
Tekla.Structures Namespace